### [참고] <a href="https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf">Pandas Cheat Sheet</a>

## apply

- https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html
- apply 라는 함수를 적용할 때 특정 컬럼에 적용하는 형태 이거나, 전체 df에 적용하는 형태 가능
- ex) df.apply(함수), df['컬럼명'].apply(함수)
- df.apply 일 때 중요한 부분은 방향임

```
DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwargs)

axis = 0 이라는 소리는 하나의 컬럼에 속하는 모든 행에 적용된다는 의미

axis = 1 이라는 소리는 하나의 행에 있는 모든 컬럼이 같이 적용 된다는 의미

```

### [실습1]

       영어   수학
Dave   60  100
David  70   50

In [ ]:
# 함수 정의

<class 'pandas.core.series.Series'>
Index(['Dave', 'David'], dtype='object')
[80 80]
<class 'pandas.core.series.Series'>
Index(['Dave', 'David'], dtype='object')
[100  50]

       영어   수학
Dave   80  100
David  80   50

In [ ]:
# 행기준을 적용시키고 싶을 때

<class 'pandas.core.series.Series'>
Index(['영어', '수학'], dtype='object')
[ 60 100]
<class 'pandas.core.series.Series'>
Index(['영어', '수학'], dtype='object')
[70 50]

       영어   수학
Dave   60  100
David  70   50

In [ ]:
# apply 를 통해 데이터 값 수정

       영어   수학
Dave   80  100
David  80   50

### [실습2]

<img src='https://www.w3resource.com/w3r_images/pandas-dataframe-apply-1.png' width="300" height="300">

   P   Q
0  9  25
1  9  25
2  9  25

     P    Q
0  3.0  5.0
1  3.0  5.0
2  3.0  5.0

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-apply-2.png" width="300" height="350">

P    27
Q    75
dtype: int64

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-apply-3.png">

0    34
1    34
2    34
dtype: int64

### [실습3]

   yyyy-mm-dd
0  2005-09-28
1  2007-10-05
2  2012-12-20

#### 1) 년-월-일 순으로 되어 있는 데이터를 받아서 년도만 잘라내서 리턴

2005-09-28
2007-10-05
2012-12-20

0    2005
1    2007
2    2012
Name: yyyy-mm-dd, dtype: object

   yyyy-mm-dd  year
0  2005-09-28  2005
1  2007-10-05  2007
2  2012-12-20  2012

#### 2) 적용할 함수와 다른 인자를 넘길 수 있는가?

   yyyy-mm-dd  year  age
0  2005-09-28  2005   16
1  2007-10-05  2007   14
2  2012-12-20  2012    9

   yyyy-mm-dd  year  age   introduce
0  2005-09-28  2005   16  나는 16 입니다.
1  2007-10-05  2007   14  나는 14 입니다.
2  2012-12-20  2012    9   나는 9 입니다.

#### 3) 여러개의 컬럼을 가져와서 apply() 적용하기

   yyyy-mm-dd  year  age   introduce                       introduce2
0  2005-09-28  2005   16  나는 16 입니다.  나는 2005 년에 태어났고, 나의 나이는 16 입니다.
1  2007-10-05  2007   14  나는 14 입니다.  나는 2007 년에 태어났고, 나의 나이는 14 입니다.
2  2012-12-20  2012    9   나는 9 입니다.   나는 2012 년에 태어났고, 나의 나이는 9 입니다.

### lambda

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

In [ ]:
# 첫번째 글자만 가져오기

0      s
1      s
2      s
3      s
4      s
      ..
145    v
146    v
147    v
148    v
149    v
Name: species, Length: 150, dtype: object

     sepal_length  sepal_width  petal_length  petal_width    species species_3
0             5.1          3.5           1.4          0.2     setosa       set
1             4.9          3.0           1.4          0.2     setosa       set
2             4.7          3.2           1.3          0.2     setosa       set
3             4.6          3.1           1.5          0.2     setosa       set
4             5.0          3.6           1.4          0.2     setosa       set
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       vir
146           6.3          2.5           5.0          1.9  virginica       vir
147           6.5          3.0           5.2          2.0  virginica       vir
148           6.2          3.4           5.4          2.3  virginica       vir
149           5.9          3.0           5.1          1.8  virginica       vir

[150 rows x 6 columns]

In [ ]:
# 뒤에서 세번쨰까지 문자 가져오기

,sepal_length,sepal_width,petal_length,petal_width,species,species_3,species-3
0,5.1,3.5,1.4,0.2,setosa,set,osa
1,4.9,3.0,1.4,0.2,setosa,set,osa
2,4.7,3.2,1.3,0.2,setosa,set,osa
3,4.6,3.1,1.5,0.2,setosa,set,osa
4,5.0,3.6,1.4,0.2,setosa,set,osa
...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,vir,ica
146,6.3,2.5,5.0,1.9,virginica,vir,ica
147,6.5,3.0,5.2,2.0,virginica,vir,ica
148,6.2,3.4,5.4,2.3,virginica,vir,ica
149,5.9,3.0,5.1,1.8,virginica,vir,ica

## map

- https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html
- apply() 와 동일하나, 데이터프레임에는 적용 못함(<b style='color:red'>시리즈</b>만 가능)
```
Series.map(arg, na_action=None)
```

### [실습1]

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

0    kitten
1     puppy
2       NaN
3       NaN
dtype: object

- map 은 dict or Series 를 받아 들임
- 값을 찾지 못하면 dict 의 경우는 NaN 으로 변환, default value 가 있다면 그 값으로

0    kitten
1     puppy
2       NaN
3       NaN
dtype: object

### [실습2]

   yyyy-mm-dd
0  2005-09-28
1  2007-10-05
2  2012-12-20

   yyyy-mm-dd  year
0  2005-09-28  2005
1  2007-10-05  2007
2  2012-12-20  2012

### [실습3]

   age        job
0   20    student
1   30  developer
2   30    teacher

   age        job  job_id
0   20    student       1
1   30  developer       2
2   30    teacher       3

## applymap

- https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.applymap.html
- 모든 값에 적용
- 시리즈 형태에다가는 적용 불가(<b style='color:red'>데이터프레임</b>만 가능)
- df['컬럼명'].applymap() => X 안됨

```
DataFrame.applymap(func, na_action=None, **kwargs)[source]
```

### [실습1]

       0      1
0  1.000  2.120
1  3.356  4.567

       0      1
0    1.0   2.12
1  3.356  4.567

   0  1
0  3  4
1  5  5

### [실습2]

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0